docs/Exemplos de XML/ConsultarNfsePorRps/ConsultarNfsePorRps.xml

<ConsultarNfseRpsEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
	<IdentificacaoRps>
		<Numero></Numero>
		<Serie></Serie>
		<Tipo></Tipo>
	</IdentificacaoRps>
	<Prestador>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>
	</Prestador>
</ConsultarNfseRpsEnvio>

------------------------------------------
<!--Com o cabeçalho Soap-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.betha.com.br/e-nota-contribuinte-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <e:ConsultarNfsePorRps>
				<nfseCabecMsg>
					<![CDATA[
						 <cabecalho xmlns="http://www.betha.com.br/e-nota-contribuinte-ws" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
					]]>				
				</nfseCabecMsg>
        <nfseDadosMsg>
					<![CDATA[
						<ConsultarNfseRpsEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
							<IdentificacaoRps>
								<Numero></Numero>
								<Serie></Serie>
								<Tipo></Tipo>
							</IdentificacaoRps>
							<Prestador>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal></InscricaoMunicipal>
							</Prestador>
						</ConsultarNfseRpsEnvio>
					]]>
				</nfseDadosMsg>
      </e:ConsultarNfsePorRps>
   </soapenv:Body>
</soapenv:Envelope>