docs/Exemplos de XML/ConsultarNfseServicoTomado/ConsultarNfseServicoTomadoPopulado.xml

<ConsultarNfseServicoTomadoEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
	<Consulente>
		<CpfCnpj>
			<Cnpj>45111111111100</Cnpj>
		</CpfCnpj>
	</Consulente>
	<PeriodoEmissao>
		<DataInicial>2014-01-01</DataInicial>
		<DataFinal>2014-12-31</DataFinal>
	</PeriodoEmissao>
	<Prestador>
		<CpfCnpj>
			<Cnpj>45111111111100</Cnpj>
		</CpfCnpj>
	</Prestador>
	<Tomador>
		<CpfCnpj>
			<Cnpj>83787494000123</Cnpj>
		</CpfCnpj>
	</Tomador>
	<Intermediario>
		<CpfCnpj>
			<Cnpj>45111111111100</Cnpj>
		</CpfCnpj>
	</Intermediario>
	<Pagina>1</Pagina>
</ConsultarNfseServicoTomadoEnvio>
					
-------------------------------------------------------------

<!--Com cabeçalho Soap-->					

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.betha.com.br/e-nota-contribuinte-ws">
  <soapenv:Header/>
  <soapenv:Body>
		<e:ConsultarNfseServicoTomado>
      <nfseCabecMsg>
				<![CDATA[
					<cabecalho xmlns="http://www.betha.com.br/e-nota-contribuinte-ws" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
				]]>
			</nfseCabecMsg>
      <nfseDadosMsg>
				<![CDATA[
					<ConsultarNfseServicoTomadoEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
						<Consulente>
							<CpfCnpj>
								<Cnpj>45111111111100</Cnpj>
							</CpfCnpj>
						</Consulente>
						<PeriodoEmissao>
							<DataInicial>2014-01-01</DataInicial>
							<DataFinal>2014-12-31</DataFinal>
						</PeriodoEmissao>
						<Prestador>
							<CpfCnpj>
								<Cnpj>45111111111100</Cnpj>
							</CpfCnpj>
						</Prestador>
						<Tomador>
							<CpfCnpj>
								<Cnpj>83787494000123</Cnpj>
							</CpfCnpj>
						</Tomador>
						<Intermediario>
							<CpfCnpj>
								<Cnpj>45111111111100</Cnpj>
							</CpfCnpj>
						</Intermediario>
						<Pagina>1</Pagina>
					</ConsultarNfseServicoTomadoEnvio>
				]]>
				</nfseDadosMsg>
      </e:ConsultarNfseServicoTomado>
   </soapenv:Body>
</soapenv:Envelope>