docs/Exemplos de XML/ConsultarNfseServicoPrestado/ConsultarNfseServicoPrestadoPopulado.xml

<ConsultarNfseServicoPrestadoEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
	<Prestador>
		<CpfCnpj>
			<Cnpj>45111111111100</Cnpj>
		</CpfCnpj>
	</Prestador>
	<NumeroNfse>61</NumeroNfse>
	<PeriodoEmissao>
		<DataInicial>2014-12-01</DataInicial>
		<DataFinal>2014-12-31</DataFinal>									
	</PeriodoEmissao>
	<Pagina>1</Pagina>
</ConsultarNfseServicoPrestadoEnvio>


------------------------------------

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.betha.com.br/e-nota-contribuinte-ws">
  <soapenv:Header/>
  <soapenv:Body>
		<e:ConsultarNfseServicoPrestado>
      <nfseCabecMsg>
				<![CDATA[
					 <cabecalho xmlns="http://www.betha.com.br/e-nota-contribuinte-ws" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
				]]>
			</nfseCabecMsg>
      <nfseDadosMsg>
				<![CDATA[
					<ConsultarNfseServicoPrestadoEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
						<Prestador>
							<CpfCnpj>
								<Cnpj>45111111111100</Cnpj>
							</CpfCnpj>
						</Prestador>
						<NumeroNfse>61</NumeroNfse>
						<PeriodoEmissao>
							<DataInicial>2014-12-01</DataInicial>
							<DataFinal>2014-12-31</DataFinal>									
						</PeriodoEmissao>
						<Pagina>1</Pagina>
					</ConsultarNfseServicoPrestadoEnvio>
				]]>
			</nfseDadosMsg>
    </e:ConsultarNfseServicoPrestado>
  </soapenv:Body>
</soapenv:Envelope>